In [1]:
import pandas as pd
import numpy as np
import json

In [2]:
file = "Resources/Heroes.json"
file_pd = pd.read_json(file)
file_pd.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [3]:
#Player Count
Total_Players = file_pd["SN"].value_counts().count()
Total_Players

573

In [4]:
player_analysis = pd.DataFrame(data={"Total Players": Total_Players},index=[0])
player_analysis.head()

   Total Players
0            573

In [5]:
#Purchasing Analysis(Total)
items = file_pd["Item Name"].value_counts()
item_count = items.count()
item_count

179

In [6]:
average_price = file_pd["Price"].mean()
average_price

2.931192307692303

In [7]:
total_price = file_pd["Price"].sum()
total_price

2286.33

In [8]:
purchasing_analysis = pd.DataFrame(data={"Total Unique Items" : (item_count),"Average Price" : (average_price), 
                                    "Total Price" : (total_price)},index=[0])
purchasing_analysis.head()

   Total Unique Items  Average Price  Total Price
0                 179       2.931192      2286.33

In [9]:
#help(pd.DataFrame)

In [10]:
#Gender Demographics
gender_count = file_pd["Gender"].value_counts()
gender_count

Male                     633
Female                   136
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [11]:
gender_percent = file_pd["Gender"].value_counts(normalize=True) * 100
gender_percent

Male                     81.153846
Female                   17.435897
Other / Non-Disclosed     1.410256
Name: Gender, dtype: float64

In [12]:
gender_analysis = pd.DataFrame({"Total Count": gender_count, "Percentage of Players": gender_percent})
gender_analysis.head()

                       Total Count  Percentage of Players
Male                           633              81.153846
Female                         136              17.435897
Other / Non-Disclosed           11               1.410256

In [13]:
#Purchasing Analysis(Gender)
group_gender = file_pd.groupby(["Gender"])

print(group_gender)

group_gender.count().head()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002294333FD68>

                       Age  Item ID  Item Name  Price   SN
Gender
Female                 136      136        136    136  136
Male                   633      633        633    633  633
Other / Non-Disclosed   11       11         11     11   11

In [14]:
num_purch = group_gender
num_purch

In [15]:
total_purch = group_gender.sum()["Price"]
total_purch

Gender
Female                    382.91
Male                     1867.68
Other / Non-Disclosed      35.74
Name: Price, dtype: float64

In [16]:
females = file_pd[file_pd['Gender'] == 'Female']
group = females.groupby('SN')
sum(group['Price'].sum() / len(group))

3.8290999999999995

In [17]:
males = file_pd[file_pd['Gender'] == 'Male']
group = males.groupby('SN')
sum(group['Price'].sum() / len(group))

4.01651612903226

In [18]:
other = file_pd[file_pd['Gender'] == 'Other / Non-Disclosed']
group = other.groupby('SN')
sum(group['Price'].sum() / len(group))

4.467499999999999

In [19]:
average_purch = group_gender["Price"].mean()
average_purch

Gender
Female                   2.815515
Male                     2.950521
Other / Non-Disclosed    3.249091
Name: Price, dtype: float64

In [20]:
#group_gender.head()

In [21]:
#file_pd[file_pd["Gender"]=="Male"].Price.mean()

In [22]:
purchase_analysis = pd.DataFrame({"Total Purchase": total_purch, "Average Purchase": average_purch})
purchase_analysis

                       Total Purchase  Average Purchase
Gender
Female                         382.91          2.815515
Male                          1867.68          2.950521
Other / Non-Disclosed           35.74          3.249091

In [23]:
#Age Demographics
raw_data = file_pd
raw_data.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [24]:
bins = [0, 9, 13, 18, 23, 28, 33, 38, 39]

group_names = ("<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+")

In [25]:
pd.cut(raw_data["Age"], bins, labels = group_names).head()

0    35-39
1    20-24
2    35-39
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [26]:
raw_data["Total Count"]=pd.cut(raw_data["Age"], bins, labels = group_names)
raw_data.head()

,Age,Gender,Item ID,Item Name,Price,SN,Total Count
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,35-39
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,20-24
2,34,Male,174,Primitive Blade,2.46,Assastnya25,35-39
3,21,Male,92,Final Critic,1.36,Pheusrical25,20-24
4,23,Male,63,Stormfury Mace,1.27,Aela59,20-24

In [27]:
raw_data = raw_data.groupby("Total Count")

print(raw_data["Total Count"].count())

raw_data[["Total Count"]].size

Total Count
<10       28
10-14     29
15-19    117
20-24    288
25-29    174
30-34     77
35-39     45
40+        5
Name: Total Count, dtype: int64

In [28]:
#raw_data[["Total Count"]].count(normalize=True) * 100

In [29]:
bin_total = raw_data[["Price"]].sum()
bin_total

              Price
Total Count
<10           83.46
10-14         82.65
15-19        333.62
20-24        832.41
25-29        522.83
30-34        233.89
35-39        128.38
40+           15.34

In [30]:
bin_mean = raw_data[["Price"]].mean()
bin_mean

                Price
Total Count
<10          2.980714
10-14        2.850000
15-19        2.851453
20-24        2.890313
25-29        3.004770
30-34        3.037532
35-39        2.852889
40+          3.068000

In [31]:
#other = raw_data[raw_data['Total Count'] == '10-14']
#group = other.groupby('SN')
#sum(group['Price'].sum() / len(group))

In [32]:
bin_summary = pd.DataFrame(data={"Total Price" : bin_total, "Mean Price" : bin_mean},index=[0])
bin_summary

       Total Price       Mean Price
0  (P, r, i, c, e)  (P, r, i, c, e)

In [33]:
sn_data = file_pd
sn_data.head()

,Age,Gender,Item ID,Item Name,Price,SN,Total Count
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,35-39
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,20-24
2,34,Male,174,Primitive Blade,2.46,Assastnya25,35-39
3,21,Male,92,Final Critic,1.36,Pheusrical25,20-24
4,23,Male,63,Stormfury Mace,1.27,Aela59,20-24

In [34]:
screen_data = sn_data["SN"].value_counts()
screen_data.head()

Undirrala66    5
Hailaphos89    4
Qarwen67       4
Sondastan54    4
Saedue76       4
Name: SN, dtype: int64

In [35]:
sn_group = sn_data.groupby("SN")

In [36]:
avg_spent = sn_group[["Price"]].mean().head()
avg_spent

                 Price
SN
Adairialis76  2.460000
Aduephos78    2.233333
Aeduera68     1.933333
Aela49        2.460000
Aela59        1.270000

In [37]:
tot_spent = sn_group[["Price"]].sum().head()
tot_spent

              Price
SN
Adairialis76   2.46
Aduephos78     6.70
Aeduera68      5.80
Aela49         2.46
Aela59         1.27

In [38]:
sn_sum = pd.DataFrame(data={"Total Purchase Value" : tot_spent, "Average Purchase Price" : avg_spent}, index=[0])
sn_sum

  Total Purchase Value Average Purchase Price
0      (P, r, i, c, e)        (P, r, i, c, e)

In [39]:
item_data = file_pd
item_data.head()

,Age,Gender,Item ID,Item Name,Price,SN,Total Count
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,35-39
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,20-24
2,34,Male,174,Primitive Blade,2.46,Assastnya25,35-39
3,21,Male,92,Final Critic,1.36,Pheusrical25,20-24
4,23,Male,63,Stormfury Mace,1.27,Aela59,20-24

In [40]:
uni_item = item_data["Item Name"].value_counts()
uni_item.head()

Final Critic                            14
Arcane Gem                              11
Betrayal, Whisper of Grieving Widows    11
Stormcaller                             10
Woeful Adamantite Claymore               9
Name: Item Name, dtype: int64

In [41]:
item_group = item_data.groupby(["Item ID", "Item Name"])
#item_group.head()

In [42]:
item_tot = item_group[["Price"]].sum()
item_tot.head()

                            Price
Item ID Item Name
0       Splinter             1.82
1       Crucifer             9.12
2       Verdict              3.40
3       Phantomlight         1.79
4       Bloodlord's Fetish   2.28

In [43]:
item_tot.sort_values("Price", ascending=False).head()

                                    Price
Item ID Item Name
34      Retribution Axe             37.26
115     Spectral Diamond Doomblade  29.75
32      Orenmir                     29.70
103     Singed Scalpel              29.22
107     Splitter, Foe Of Subtlety   28.88